# FailedToChangeWallJointsTypeFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinFailures..::..FailedToChangeWallJointsTypeFailure Property
BuiltInFailures..::..WallJoinFailures Class See Also
---
Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedToChangeWallJointsTypeFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedToChangeWallJointsTypeFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedToChangeWallJointsTypeFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallJoinFailures Class
Autodesk.Revit.DB Namespace